Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication setFields

runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
